export const introduces = [
    'Next.js와 React.js를 기반으로 다양한 웹 서비스의 초기 환경 구축부터 구조 설계까지 주도적으로 참여해온 프론트엔드 개발자입니다.',
    '디자인 시스템 구축, FSD(Folder-Sliced Design) 아키텍처 도입, 공통 컴포넌트 체계화 등을 통해 일관성 있는 개발 환경과 확장 가능한 구조를 설계해왔으며 Storybook, Radix UI, Tiptap 등을 적극 도입하고 커스터마이징하여 디자이너와의 피드백 루프를 단축하고 협업 효율을 높인 경험이 있습니다. ',
    '공통 API 핸들러 설계, Tanstack Query 기반 캐싱 전략 적용, 이미지 최적화 등을 통해 실제 서비스의 성능과 사용자 경험을 함께 개선한 경험이 다수 있으며, 레거시 프레임워크를 Vue3 + TypeScript 기반으로 재설계하고 모듈화하며 초기 진입 장벽을 낮추고 유지보수성을 높이는 구조 개선 작업도 주도했습니다.',
    '개인 프로젝트는 모두 일상 속의 불편함을 기술로 해결하는 데 초점을 맞추어 기획 및 개발했으며, 웹툰 북마크 앱, 환율 알림 서비스, 특가 정보 크롤러 등 실생활에 밀접한 도구들을 직접 구현하고 꾸준히 개선해왔습니다.',
]
