export const introduces = [
    'Next.js와 React.js를 주력으로 하는 프론트엔드 개발자입니다.',
    'TypeScript, Tailwind CSS, Radix-UI 등 최신 프론트엔드 기술 스택을 적극 활용하여 다양한 웹 서비스의 초기 환경 구축부터 설계까지 주도적인 역할을 맡아왔습니다.  다수의 프로젝트에서 환경 구축 및 설계 단계부터 참여했으며, Feature-Sliced Design(FSD) 아키텍처 마이그레이션과 React Query, SWR 등 편의 기술 도입을 통해 견고하고 더욱더 빠른 개발자간의 협업이 가능하게 되었으며, 사용자에게도 질 좋은 프로덕트를 제공하게 되었습니다.',
    '디자인 시스템 구축 및 B2C 플랫폼 개발 시 Storybook을 적극적으로 도입하여 디자인-개발 간 협업 효율성을 높였으며, 도큐먼트 관리가 필요한 프로젝트의 경우 파일 시스템 기반의 SSG 동적 라우팅을 활용하여 유연성을 확보했습니다. 더나아가 GitHub Actions를 활용한 CI/CD 자동화를 구축하여 프런트팀의 생산성을 높이고 서비스 품질 향상에도 기여했습니다.',
    '개인 프로젝트로는 일상에서 느끼는 불편함을 해소하고자 환율 알림 서비스, 웹툰 사이트 기능 개선, 특가 정보 수집 플랫폼 등을 직접 기획하고 배포하였습니다. 실제 주변 사용자들의 피드백을 적극적으로 반영하여 고도화하는 등 사용자 중심의 기술적 문제 해결을 통해 재미있고 보람차게 성장하고 있습니다.',
]
